---
kind: method
id: M:Autodesk.Revit.DB.FaceDetailNode.GetLinkTransform
source: html/db8ec5d5-a63f-dd37-867d-8a6a228c665b.htm
---
# Autodesk.Revit.DB.FaceDetailNode.GetLinkTransform Method

Returns link transform of the object being drawn.

## Syntax (C#)
```csharp
public Transform GetLinkTransform()
```